#include "Client_function.h"

// 工作线程，接受服务器返回来的消息

int main(int count, char *arg[])
{

   setbuf(stdout, NULL);
   int sID = init_net();

   while (1)
   {
      char buf[128];
      system("clear");
      printf("+-------------------------------------------------+\n");
      // 标题行
      printf("|                XX购物平台 - 主界面              |\n");
      // 中间分隔线
      printf("+-------------------------------------------------+\n");
      // 功能选项行，适当添加空格让文本更居中些
      printf("|               [>] 1. 登录账号                   |\n");
      printf("+-------------------------------------------------+\n");
      printf("|               [+] 2. 注册账号                   |\n");
      printf("+-------------------------------------------------+\n");
      printf("|               [X] 3. 退出程序                   |\n");
      // 下边框
      printf("+-------------------------------------------------+\n");
      printf("   请输入的操作:");
      // 下边框
      fflush(stdout);
      scanf("%s", buf);

      choice_main_C(sID, buf);
   }

   close(sID);



// printf("账号：%s 昵称：%s  地址；%s\n",);
//    printf("-------------------------------------------\n");  
//    printf("|%-10s  %-30s |\n", "密码 ","222");
//    printf("-------------------------------------------\n");
// printf("|%-10s  %-30s |\n", "密码 ","222");
//    printf("-------------------------------------------\n");
//   printf("|%-10s  %-30s |\n", "密码 ","222");
//    printf("-------------------------------------------\n");

//    char a[400];
//     char b[400];
// sprintf(a,"商品ID：%d    名称：%s    状态：%s",2,"香蕉","在售");
// sprintf(b,"价格:%.2lf   库存：%d       商家名称:%s ",41.231,3,"222");
               
//    printf("-------------------------------------------\n");
//   printf("|%-53s |\n", a);
//   printf("|%-49s |\n", b);
//    printf("-------------------------------------------\n");


//    printf("-------------------------------------------\n");
//   printf("|%-53s |\n", a);
//   printf("|%-49s |\n", b);
//    printf("-------------------------------------------\n");

// printf("请选择操作：1.购买商品 2.查看商品介绍 3.联系商家 4.状态\n");



//    printf("|%-50s |\n", "1.交易论坛");
//    printf("-------------------------------------------\n");
//    printf("|%-50s |\n", "1.交易论坛");
//    printf("-------------------------------------------\n");
//    printf("|%-50s |\n", "1.交易论坛");
//    printf("-------------------------------------------\n");


   return 0;
}